/*==============================================================================

   当たり判定処理 [collision.cpp]
														 Author :	髙橋建次
														 Date   :	2022_11_21	last_update
--------------------------------------------------------------------------------

==============================================================================*/
#include	"main.h"
#include	"collision.h"

#include	<math.h>

//=================================================
//マクロ定義
//=================================================

//=================================================
//プロトタイプ宣言
//=================================================

/*
	四角形同士の当たり判定関数
	in	四角形１中心座標、四角形２中心座標、四角形１サイズ、四角形２サイズ
	out	true:衝突している		false:衝突していない
*/
bool	CollisionBB(D3DXVECTOR2 pos1, D3DXVECTOR2 pos2, D3DXVECTOR2 size1, D3DXVECTOR2 size2)
{
	D3DXVECTOR2	distance = pos2 - pos1;		//四角形の中心座標間の距離

	D3DXVECTOR2	halfsize1 = size1 * 0.5f;	//四角形1のサイズの半分
	D3DXVECTOR2	halfsize2 = size2 * 0.5f;	//四角形2のサイズの半分

	//X軸に関して、四角形サイズの半分の合計が、中心座標間の距離の絶対値より大きいか判定
	if (fabsf(distance.x) < (halfsize1.x + halfsize2.x))
	{
		//Y軸に関して、四角形サイズの半分の合計が、中心座標間の距離の絶対値より大きいか判定
		if (fabsf(distance.y) < (halfsize1.y + halfsize2.y))
		{
			//両方とも満たしていればtrueを返す
			return	true;
		}
		else
		{
			return	false;
		}
	}
	else
	{
		return	false;
	}
}
