/*==============================================================================

   頂点管理 [polygon.cpp]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#include	"polygon.h"

#include	"sprite.h"



#include "texture.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_VERTEX 4
#define	NUM_TRIANGLE_VERTEX	(4)	//三角形用頂点数

#define	BOX_W	(700)	//四角形の横のサイズ
#define	BOX_H	(700)	//四角形の縦のサイズ


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
//void SetVertex(D3DXVECTOR3, D3DXVECTOR3, D3DXCOLOR);	//直線を表示する
//void SetVertexTringle(float, float, int, int, float, D3DXCOLOR);	//三角形用頂点格納処理

//*****************************************************************************
// グローバル変数
//*****************************************************************************
//static	ID3D11Buffer		*g_VertexBuffer = NULL;		// 頂点情報



D3DXVECTOR3		MoveVec;



//テクスチャインデックス
int TextureNo = 0;




//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitPolygon(void)
{
	
	


	ID3D11Device *pDevice = GetDevice();
	
	

	//スプライト初期化
	InitSprite();

	


	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitPolygon(void)
{

	//テクスチャの解放
	UninitTexture();

	//スプライト終了処理
	UninitSprite();
	

	


	//UninitLineCircle();

}

//=============================================================================
// 更新処理
//=============================================================================
void UpdatePolygon(void)
{
	

	

}

//=============================================================================
// 描画処理
//=============================================================================
void DrawPolygon(void)
{
	{
	

		// ２Ｄ表示をするためのマトリクスを設定
		SetWorldViewProjection2D();

		//// プリミティブトポロジ設定
		//GetDeviceContext()->IASetPrimitiveTopology(D3D11_PRIMITIVE_TOPOLOGY_LINELIST);

		// マテリアル設定
		MATERIAL material;
		ZeroMemory(&material, sizeof(material));
		material.Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
		/*SetMaterial(material);*/

	}

	
	


	




}


