//==============================
//テクスチャ管理
//
//==============================
#pragma once

#include "renderer.h"

//==============================
//テクスチャのロード
//in	テクスチャファイル名の先頭ポインタ
//out	ロードしたテクスチャハンドル
//							提供するための名前
//==============================
int		LoadTexture(char* filename);

//==============================
//テクスチャの終了処理
//ロード済みのテクスチャを全て解放
void	UninitTexture();

//===============================
//指定のテクスチャ情報を取得
//in	使用したいテクスチャハンドル
//ID3D11ShaderResourceView**で　テクスチャを貰う
//===============================
ID3D11ShaderResourceView** GetTexture(int index);//ID3D11ShaderResourceView**はポインタ変数のポインタ
